In [1]:
import pandas as pd

In [92]:
#read totaldemand_nsw csv file
totaldemand = pd.read_csv('../data/totaldemand_nsw.csv')
totaldemand.head()

        DATETIME  TOTALDEMAND REGIONID
0  1/1/2010 0:00      8038.00     NSW1
1  1/1/2010 0:30      7809.31     NSW1
2  1/1/2010 1:00      7483.69     NSW1
3  1/1/2010 1:30      7117.23     NSW1
4  1/1/2010 2:00      6812.03     NSW1

In [93]:
#drop REGIONID column
totaldemand = totaldemand.drop(columns=['REGIONID'])
totaldemand.head()

        DATETIME  TOTALDEMAND
0  1/1/2010 0:00      8038.00
1  1/1/2010 0:30      7809.31
2  1/1/2010 1:00      7483.69
3  1/1/2010 1:30      7117.23
4  1/1/2010 2:00      6812.03

In [94]:
#dimension of the data
totaldemand.shape

(196513, 2)

In [95]:
#check for missing values
totaldemand.isnull().sum()

DATETIME       0
TOTALDEMAND    0
dtype: int64

In [100]:
#check for duplicates
totaldemand_duplicate = totaldemand[totaldemand.duplicated(subset='DATETIME')]
totaldemand_duplicate.shape

(0, 2)

### Temperature Data

In [101]:
#read temperature_nsw csv file
temperature = pd.read_csv('../data/temperature_nsw.csv')
temperature.head()

    LOCATION       DATETIME  TEMPERATURE
0  Bankstown  1/1/2010 0:00         23.1
1  Bankstown  1/1/2010 0:01         23.1
2  Bankstown  1/1/2010 0:30         22.9
3  Bankstown  1/1/2010 0:50         22.7
4  Bankstown  1/1/2010 1:00         22.6

In [102]:
#drop LOCATION column
temperature = temperature.drop(columns=['LOCATION'])
temperature.head()

        DATETIME  TEMPERATURE
0  1/1/2010 0:00         23.1
1  1/1/2010 0:01         23.1
2  1/1/2010 0:30         22.9
3  1/1/2010 0:50         22.7
4  1/1/2010 1:00         22.6

In [103]:
#dimension of the data
temperature.shape

(220326, 2)

In [104]:
#check for missing values
print(totaldemand.isnull().sum())
print(temperature.isnull().sum())

DATETIME       0
TOTALDEMAND    0
dtype: int64
DATETIME       0
TEMPERATURE    0
dtype: int64

In [105]:
#check for duplicates
temp_duplicate = temperature[temperature.duplicated(subset='DATETIME')]
temp_duplicate.shape

(13, 2)

In [106]:
temp_duplicate

                DATETIME  TEMPERATURE
19006      1/1/2011 0:00         21.0
34282   10/10/2011 10:30         18.9
34299   10/10/2011 18:30         16.1
34302   10/10/2011 19:30         15.5
38655      1/1/2012 0:00         15.4
58293      1/1/2013 0:00         21.0
78276      1/1/2014 0:00         20.4
97917      1/1/2015 0:00         20.9
117699     1/1/2016 0:00         16.9
137200     1/1/2017 0:00         22.6
157015     1/1/2018 0:00         22.4
176797     1/1/2019 0:00         22.3
196230     1/1/2020 0:00         19.4

In [107]:
#show all the duplicates rows
temperature[temperature.duplicated(subset='DATETIME', keep=False)]

                DATETIME  TEMPERATURE
19005      1/1/2011 0:00         21.0
19006      1/1/2011 0:00         21.0
34281   10/10/2011 10:30         18.9
34282   10/10/2011 10:30         18.9
34298   10/10/2011 18:30         16.1
34299   10/10/2011 18:30         16.1
34301   10/10/2011 19:30         15.5
34302   10/10/2011 19:30         15.5
38654      1/1/2012 0:00         15.4
38655      1/1/2012 0:00         15.4
58292      1/1/2013 0:00         21.0
58293      1/1/2013 0:00         21.0
78275      1/1/2014 0:00         20.4
78276      1/1/2014 0:00         20.4
97916      1/1/2015 0:00         20.9
97917      1/1/2015 0:00         20.9
117698     1/1/2016 0:00         16.9
117699     1/1/2016 0:00         16.9
137199     1/1/2017 0:00         22.6
137200     1/1/2017 0:00         22.6
157014     1/1/2018 0:00         22.4
157015     1/1/2018 0:00         22.4
176796     1/1/2019 0:00         22.3
176797     1/1/2019 0:00         22.3
196229     1/1/2020 0:00         19.4
196230     1/1/2020 0:00         19.4

In [108]:
temperature.shape

(220326, 2)

In [109]:
#drop duplicates
temperature = temperature.drop_duplicates(subset='DATETIME')
temperature.shape

(220313, 2)

### Merge temperature and demand

In [110]:
#join the two dataframes on the DATETIME column
data = pd.merge(totaldemand, temperature, on='DATETIME')
data.head()

        DATETIME  TOTALDEMAND  TEMPERATURE
0  1/1/2010 0:00      8038.00         23.1
1  1/1/2010 0:30      7809.31         22.9
2  1/1/2010 1:00      7483.69         22.6
3  1/1/2010 1:30      7117.23         22.5
4  1/1/2010 2:00      6812.03         22.5

In [111]:
data.shape

(195934, 3)

In [112]:
data.isna().sum()

DATETIME       0
TOTALDEMAND    0
TEMPERATURE    0
dtype: int64

In [113]:
#check for duplicates
data_duplicate = data[data.duplicated(subset='DATETIME')]
data_duplicate.shape

(0, 3)

In [114]:
#create a new column 'SEASON' based on the month
data['DATETIME'] = pd.to_datetime(data['DATETIME'], format='%d/%m/%Y %H:%M')
data['SEASON'] = data['DATETIME'].dt.month
data['SEASON'] = data['SEASON'].apply(lambda x: 'Summer' if x in [12, 1, 2] else ('Autumn' if x in [3, 4, 5] else ('Winter' if x in [6, 7, 8] else 'Spring')))
data.head()

             DATETIME  TOTALDEMAND  TEMPERATURE  SEASON
0 2010-01-01 00:00:00      8038.00         23.1  Summer
1 2010-01-01 00:30:00      7809.31         22.9  Summer
2 2010-01-01 01:00:00      7483.69         22.6  Summer
3 2010-01-01 01:30:00      7117.23         22.5  Summer
4 2010-01-01 02:00:00      6812.03         22.5  Summer

In [115]:
#create a new column 'Weekday' based on the day of the week 
data['WEEKDAY'] = data['DATETIME'].dt.day_name()
data.head()

             DATETIME  TOTALDEMAND  TEMPERATURE  SEASON WEEKDAY
0 2010-01-01 00:00:00      8038.00         23.1  Summer  Friday
1 2010-01-01 00:30:00      7809.31         22.9  Summer  Friday
2 2010-01-01 01:00:00      7483.69         22.6  Summer  Friday
3 2010-01-01 01:30:00      7117.23         22.5  Summer  Friday
4 2010-01-01 02:00:00      6812.03         22.5  Summer  Friday

In [116]:
#export the data to a new csv file
data.to_csv('../data/totaldemand_temperature_nsw.csv', index=False)

In [117]:
#export the data to a new zip file
data.to_csv('../data/totaldemand_temperature_nsw.zip', index=False, compression='zip')

Combining temperature and demand data with holiday data

In [118]:
#read the data from the csv file
datedata = pd.read_csv('../data/date_dim.csv')
datedata.head()

,Unnamed: 0,Calendar_Date,DayOfWeek,Week,Quarter,Month,Year,Year_half,Summer,Autumn,Winter,Spring,is_weekday,Description,is_holiday
0,0,2014-01-01,3,1,1,1,2014,1,1,0,0,0,1,New Year's Day,1
1,1,2014-01-02,4,1,1,1,2014,1,1,0,0,0,1,NaN,0
2,2,2014-01-03,5,1,1,1,2014,1,1,0,0,0,1,NaN,0
3,3,2014-01-04,6,1,1,1,2014,1,1,0,0,0,0,NaN,0
4,4,2014-01-05,7,1,1,1,2014,1,1,0,0,0,0,NaN,0

In [119]:
#copy the data to a new dataframe with calender_date, DayOfWeek, Summer, Autumn, Winter, Spring, is_weekday, is_holiday columns
new_date_data = datedata.copy()
#drop the columns not needed
new_date_data = new_date_data.drop(columns=['Unnamed: 0','Week', 'Quarter', 'Month', 'Year', 'Year_half', 'Description'])
new_date_data.head()

,Calendar_Date,DayOfWeek,Summer,Autumn,Winter,Spring,is_weekday,is_holiday
0,2014-01-01,3,1,0,0,0,1,1
1,2014-01-02,4,1,0,0,0,1,0
2,2014-01-03,5,1,0,0,0,1,0
3,2014-01-04,6,1,0,0,0,0,0
4,2014-01-05,7,1,0,0,0,0,0

In [124]:
new_date_data[new_date_data['Calendar_Date'] == '2014-12-25']

,Calendar_Date,DayOfWeek,Summer,Autumn,Winter,Spring,is_weekday,is_holiday
358,2014-12-25,4,1,0,0,0,1,1

In [125]:
#remane one column
new_date_data = new_date_data.rename(columns={'Calendar_Date': 'DATE'})
new_date_data.head()

,DATE,DayOfWeek,Summer,Autumn,Winter,Spring,is_weekday,is_holiday
0,2014-01-01,3,1,0,0,0,1,1
1,2014-01-02,4,1,0,0,0,1,0
2,2014-01-03,5,1,0,0,0,1,0
3,2014-01-04,6,1,0,0,0,0,0
4,2014-01-05,7,1,0,0,0,0,0

In [126]:
new_date_data.isna().sum()

DATE          0
DayOfWeek     0
Summer        0
Autumn        0
Winter        0
Spring        0
is_weekday    0
is_holiday    0
dtype: int64

In [127]:
new_date_data.dtypes

DATE          object
DayOfWeek      int64
Summer         int64
Autumn         int64
Winter         int64
Spring         int64
is_weekday     int64
is_holiday     int64
dtype: object

In [128]:
#max and min value of the DATE column
new_date_data['DATE'].max(), new_date_data['DATE'].min()

('2022-12-31', '2014-01-01')

In [129]:
#remove the rows after 2020-12-31
new_date_data = new_date_data[new_date_data['DATE'] <= '2021-03-18']
new_date_data['DATE'].max(), new_date_data['DATE'].min()

('2021-03-18', '2014-01-01')

In [130]:
#read the data from the csv file
demand_temperature_data = pd.read_csv('../data/totaldemand_temperature_nsw.csv')
demand_temperature_data.head()

              DATETIME  TOTALDEMAND  TEMPERATURE  SEASON WEEKDAY
0  2010-01-01 00:00:00      8038.00         23.1  Summer  Friday
1  2010-01-01 00:30:00      7809.31         22.9  Summer  Friday
2  2010-01-01 01:00:00      7483.69         22.6  Summer  Friday
3  2010-01-01 01:30:00      7117.23         22.5  Summer  Friday
4  2010-01-01 02:00:00      6812.03         22.5  Summer  Friday

In [131]:
demand_temperature_data.shape

(195934, 5)

In [132]:
#create a new column 'DATE' based on the DATETIME column
demand_temperature_data['DATETIME'] = pd.to_datetime(demand_temperature_data['DATETIME'], format='%Y-%m-%d %H:%M:%S')
demand_temperature_data.head()

             DATETIME  TOTALDEMAND  TEMPERATURE  SEASON WEEKDAY
0 2010-01-01 00:00:00      8038.00         23.1  Summer  Friday
1 2010-01-01 00:30:00      7809.31         22.9  Summer  Friday
2 2010-01-01 01:00:00      7483.69         22.6  Summer  Friday
3 2010-01-01 01:30:00      7117.23         22.5  Summer  Friday
4 2010-01-01 02:00:00      6812.03         22.5  Summer  Friday

In [134]:
#create a new column 'DATE' and get the date from the DATETIME column
demand_temperature_data['DATE'] = demand_temperature_data['DATETIME'].dt.date
demand_temperature_data.head()

             DATETIME  TOTALDEMAND  TEMPERATURE  SEASON WEEKDAY        DATE
0 2010-01-01 00:00:00      8038.00         23.1  Summer  Friday  2010-01-01
1 2010-01-01 00:30:00      7809.31         22.9  Summer  Friday  2010-01-01
2 2010-01-01 01:00:00      7483.69         22.6  Summer  Friday  2010-01-01
3 2010-01-01 01:30:00      7117.23         22.5  Summer  Friday  2010-01-01
4 2010-01-01 02:00:00      6812.03         22.5  Summer  Friday  2010-01-01

In [135]:
#remove the rows before 2014-01-01
demand_temperature_data = demand_temperature_data[demand_temperature_data['DATETIME'] >= '2014-01-01']
demand_temperature_data['DATETIME'].max(), demand_temperature_data['DATETIME'].min()

(Timestamp('2021-03-18 00:00:00'), Timestamp('2014-01-01 00:00:00'))

In [136]:
demand_temperature_data.shape

(126129, 6)

In [137]:
demand_temperature_data.dtypes, new_date_data.dtypes

(DATETIME       datetime64[ns]
 TOTALDEMAND           float64
 TEMPERATURE           float64
 SEASON                 object
 WEEKDAY                object
 DATE                   object
 dtype: object,
 DATE          object
 DayOfWeek      int64
 Summer         int64
 Autumn         int64
 Winter         int64
 Spring         int64
 is_weekday     int64
 is_holiday     int64
 dtype: object)

In [138]:
demand_temperature_data.head()

,DATETIME,TOTALDEMAND,TEMPERATURE,SEASON,WEEKDAY,DATE
69805,2014-01-01 00:00:00,7009.91,20.4,Summer,Wednesday,2014-01-01
69806,2014-01-01 00:30:00,6840.01,19.8,Summer,Wednesday,2014-01-01
69807,2014-01-01 01:00:00,6580.75,19.5,Summer,Wednesday,2014-01-01
69808,2014-01-01 01:30:00,6212.79,19.2,Summer,Wednesday,2014-01-01
69809,2014-01-01 02:00:00,5988.92,18.8,Summer,Wednesday,2014-01-01

In [139]:
# find duplicates
demand_temperature_data.duplicated().sum()

0

In [140]:
# dimension of the data
demand_temperature_data.shape, new_date_data.shape

((126129, 6), (2636, 8))

In [141]:
new_date_data['DATE'] = pd.to_datetime(new_date_data['DATE'])
new_date_data.dtypes

DATE          datetime64[ns]
DayOfWeek              int64
Summer                 int64
Autumn                 int64
Winter                 int64
Spring                 int64
is_weekday             int64
is_holiday             int64
dtype: object

In [142]:
new_date_data.head()

,DATE,DayOfWeek,Summer,Autumn,Winter,Spring,is_weekday,is_holiday
0,2014-01-01,3,1,0,0,0,1,1
1,2014-01-02,4,1,0,0,0,1,0
2,2014-01-03,5,1,0,0,0,1,0
3,2014-01-04,6,1,0,0,0,0,0
4,2014-01-05,7,1,0,0,0,0,0

In [143]:
demand_temperature_data['DATE'] = pd.to_datetime(demand_temperature_data['DATE'])
demand_temperature_data.dtypes

DATETIME       datetime64[ns]
TOTALDEMAND           float64
TEMPERATURE           float64
SEASON                 object
WEEKDAY                object
DATE           datetime64[ns]
dtype: object

In [144]:
holiday_merged = pd.merge(demand_temperature_data, new_date_data, how='left', on='DATE')
holiday_merged.head()

,DATETIME,TOTALDEMAND,TEMPERATURE,SEASON,WEEKDAY,DATE,DayOfWeek,Summer,Autumn,Winter,Spring,is_weekday,is_holiday
0,2014-01-01 00:00:00,7009.91,20.4,Summer,Wednesday,2014-01-01,3,1,0,0,0,1,1
1,2014-01-01 00:30:00,6840.01,19.8,Summer,Wednesday,2014-01-01,3,1,0,0,0,1,1
2,2014-01-01 01:00:00,6580.75,19.5,Summer,Wednesday,2014-01-01,3,1,0,0,0,1,1
3,2014-01-01 01:30:00,6212.79,19.2,Summer,Wednesday,2014-01-01,3,1,0,0,0,1,1
4,2014-01-01 02:00:00,5988.92,18.8,Summer,Wednesday,2014-01-01,3,1,0,0,0,1,1

In [145]:
holiday_merged.shape

(126225, 13)

In [146]:
holiday_merged.isna().sum()

DATETIME       0
TOTALDEMAND    0
TEMPERATURE    0
SEASON         0
WEEKDAY        0
DATE           0
DayOfWeek      0
Summer         0
Autumn         0
Winter         0
Spring         0
is_weekday     0
is_holiday     0
dtype: int64

In [147]:
holiday_merged['DATE'].max(), holiday_merged['DATE'].min()

(Timestamp('2021-03-18 00:00:00'), Timestamp('2014-01-01 00:00:00'))

In [148]:
final_data = holiday_merged.copy()
final_data.head()

,DATETIME,TOTALDEMAND,TEMPERATURE,SEASON,WEEKDAY,DATE,DayOfWeek,Summer,Autumn,Winter,Spring,is_weekday,is_holiday
0,2014-01-01 00:00:00,7009.91,20.4,Summer,Wednesday,2014-01-01,3,1,0,0,0,1,1
1,2014-01-01 00:30:00,6840.01,19.8,Summer,Wednesday,2014-01-01,3,1,0,0,0,1,1
2,2014-01-01 01:00:00,6580.75,19.5,Summer,Wednesday,2014-01-01,3,1,0,0,0,1,1
3,2014-01-01 01:30:00,6212.79,19.2,Summer,Wednesday,2014-01-01,3,1,0,0,0,1,1
4,2014-01-01 02:00:00,5988.92,18.8,Summer,Wednesday,2014-01-01,3,1,0,0,0,1,1

In [149]:
#drop columns  SEASON, WEEKDAY, DATE
final_data = final_data.drop(columns=['SEASON', 'WEEKDAY', 'DATE'])
final_data.head()

,DATETIME,TOTALDEMAND,TEMPERATURE,DayOfWeek,Summer,Autumn,Winter,Spring,is_weekday,is_holiday
0,2014-01-01 00:00:00,7009.91,20.4,3,1,0,0,0,1,1
1,2014-01-01 00:30:00,6840.01,19.8,3,1,0,0,0,1,1
2,2014-01-01 01:00:00,6580.75,19.5,3,1,0,0,0,1,1
3,2014-01-01 01:30:00,6212.79,19.2,3,1,0,0,0,1,1
4,2014-01-01 02:00:00,5988.92,18.8,3,1,0,0,0,1,1

In [150]:
#rename the columns
final_data = final_data.rename(columns={'DATETIME': 'DATETIME', 'TOTALDEMAND': 'TOTALDEMAND', 'TEMPERATURE': 'TEMPERATURE', 'DayOfWeek': 'DAYOFWEEK', 'Summer': 'SUMMER', 'Autumn': 'AUTUMN', 'Winter': 'WINTER', 'Spring': 'SPRING', 'is_weekday': 'WEEKDAY', 'is_holiday': 'HOLIDAY'})
final_data.head()

,DATETIME,TOTALDEMAND,TEMPERATURE,DAYOFWEEK,SUMMER,AUTUMN,WINTER,SPRING,WEEKDAY,HOLIDAY
0,2014-01-01 00:00:00,7009.91,20.4,3,1,0,0,0,1,1
1,2014-01-01 00:30:00,6840.01,19.8,3,1,0,0,0,1,1
2,2014-01-01 01:00:00,6580.75,19.5,3,1,0,0,0,1,1
3,2014-01-01 01:30:00,6212.79,19.2,3,1,0,0,0,1,1
4,2014-01-01 02:00:00,5988.92,18.8,3,1,0,0,0,1,1

In [153]:
final_data.dtypes

DATETIME       datetime64[ns]
TOTALDEMAND           float64
TEMPERATURE           float64
DAYOFWEEK               int64
SUMMER                  int64
AUTUMN                  int64
WINTER                  int64
SPRING                  int64
WEEKDAY                 int64
HOLIDAY                 int64
dtype: object

In [154]:
duplicate_data = final_data[final_data.duplicated(subset='DATETIME')]
duplicate_data.DATETIME.sort_values()

52431   2017-01-02 00:00:00
52433   2017-01-02 00:30:00
52435   2017-01-02 01:00:00
52437   2017-01-02 01:30:00
52439   2017-01-02 02:00:00
                ...
57988   2017-04-25 21:30:00
57990   2017-04-25 22:00:00
57992   2017-04-25 22:30:00
57994   2017-04-25 23:00:00
57996   2017-04-25 23:30:00
Name: DATETIME, Length: 96, dtype: datetime64[ns]

In [157]:
#show all the duplicates rows
final_data[final_data.duplicated(subset='DATETIME', keep=False)]

,DATETIME,TOTALDEMAND,TEMPERATURE,DAYOFWEEK,SUMMER,AUTUMN,WINTER,SPRING,WEEKDAY,HOLIDAY
52430,2017-01-02 00:00:00,6847.27,22.6,1,1,0,0,0,1,1
52431,2017-01-02 00:00:00,6847.27,22.6,1,1,0,0,0,1,1
52432,2017-01-02 00:30:00,6678.33,22.9,1,1,0,0,0,1,1
52433,2017-01-02 00:30:00,6678.33,22.9,1,1,0,0,0,1,1
52434,2017-01-02 01:00:00,6487.85,22.9,1,1,0,0,0,1,1
...,...,...,...,...,...,...,...,...,...,...
57992,2017-04-25 22:30:00,7041.88,19.8,2,0,1,0,0,1,1
57993,2017-04-25 23:00:00,6880.41,19.5,2,0,1,0,0,1,1
57994,2017-04-25 23:00:00,6880.41,19.5,2,0,1,0,0,1,1
57995,2017-04-25 23:30:00,6877.11,18.9,2,0,1,0,0,1,1
57996,2017-04-25 23:30:00,6877.11,18.9,2,0,1,0,0,1,1

In [158]:
#remove duplicates
final_data = final_data.drop_duplicates(subset='DATETIME')

In [159]:
final_data.shape

(126129, 10)

In [161]:
#export the data to a new csv file
data.to_csv('../data/final_data_nsw.csv', index=False)

In [160]:
#export the data to a new zip file
final_data.to_csv('../data/final_data_nsw.zip', index=False, compression='zip')